gemi254/ConfigAssist-ESP32-ESP8266/src/ConfigAssist.cpp
// Get location of given key to retrieve other elements
int ConfigAssist::getKeyPos(String key) {
  if(!_init) init();
  if (_configs.empty()) return -1;
  auto lower = std::lower_bound(_configs.begin(), _configs.end(), key, [](
      const confPairs &a, const String &b) { 
      return a.name < b;}
  );
  int keyPos = std::distance(_configs.begin(), lower); 
  if (key == _configs[keyPos].name) return keyPos;
  else LOG_V("Get pos, key %s not found.\n", key.c_str()); 
  return -1; // Not found
}

// Get seperation location of given key
int ConfigAssist::getSepKeyPos(String key) {
  if (_seperators.empty()) return -1;
  auto lower = std::lower_bound(_seperators.begin(), _seperators.end(), key, [](
      const confSeperators &a, const String &b) { 
      return a.name < b;}
  );
  int keyPos = std::distance(_seperators.begin(), lower); 
  if (key == _seperators[keyPos].name) return keyPos;
  LOG_N("Sep key %s not found.\n", key.c_str()); 
  return -1; // not found
}

// Extract a config tokens from keyValPair and load it into configs vector
void ConfigAssist::loadVectItem(String keyValPair) {  
  if (!keyValPair.length()) return;

  std::string token[2];
  int i = 0;
  std::istringstream pair(keyValPair.c_str());
  String key,val;
  while (std::getline(pair, token[i++], CA_INI_FILE_DELIM));
  if (i != 3){ 
    if (i == 2) { //Empty param
      key = token[0].c_str(); 
      val = "";
    }else{
      LOG_E("Unable to parse '%s', len %u, items: %i\n", keyValPair.c_str(), keyValPair.length(), i);
    }
  }else{
    key = token[0].c_str(); 
    val = token[1].c_str();
#if CA_DONT_ALLOW_SPACES
    val.replace(" ","");
#endif
  }
  val.replace("\r","");
  val.replace("\n","");

#ifdef CA_USE_PERSIST_CON      
  String no;
  if(endsWith(key,CA_SSID_KEY, no)){ 
    loadPref(key, val);        
  }else if(endsWith(key,CA_PASSWD_KEY, no)){
    loadPref(key, val);
  }
#endif

  //No label added for memory issues
  add(key, val, true);
  if (_configs.size() > CA_MAX_PARAMS) 
    LOG_W("Config file entries: %u exceed max: %u\n", _configs.size(), CA_MAX_PARAMS);
}

#ifdef CA_USE_WIFISCAN     
// Build json on Wifi scan complete     
void ConfigAssist::scanComplete(int networksFound) {
  LOG_I("%d network(s) found\n", networksFound);      
  if( networksFound <= 0 ) return;
  
  _jWifi = "[";
  for (int i = 0; i < networksFound; ++i){
      if(i) _jWifi += ",\n";
      _jWifi += "{";
      _jWifi += "\"rssi\":"+String(WiFi.RSSI(i));
      _jWifi += ",\"ssid\":\""+WiFi.SSID(i)+"\"";
      _jWifi += "}";
      LOG_D("%i,%s\n", WiFi.RSSI(i), WiFi.SSID(i).c_str());
    }
  _jWifi += "]";
  LOG_V("Scan complete \n");    
}

// Send wifi scan results to client
void ConfigAssist::checkScanRes(){
  int n = WiFi.scanComplete();
  if(n>0){
    scanComplete(n);
    WiFi.scanDelete();
    startScanWifi();
  }        
}

// Start async wifi scan
void ConfigAssist::startScanWifi(){
  int n = WiFi.scanComplete();
  if(n==-1){
    LOG_D("Scan in progress..\n");
  }else if(n==-2){
    LOG_D("Starting async scan..\n");          
    WiFi.scanNetworks(/*async*/true,/*show_hidden*/true);
  }else{
    LOG_D("Scan complete status: %i\n", n);
  }
}  
#endif //CA_USE_WIFISCAN